rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
	def find
		#debugger
		#director = params[:id]
		@movies = Movie.find_all_by_director(params[:director])